# name = "Коля"
# day = 13
#
# print(f"{name:10} запустил свой стартап!")
# print(f"Сегодня пятница {day:5}")
#
#
# name = "Чацкий Николай Петрович"
# day = 1234567890
#
# print(f"{name:10} запустил свой стартап!")
# print(f"Сегодня пятница {day:5}")


# name = "Коля"
# day = 13
#
# print(f"{name:10s} запустил свой стартап!")
# print(f"Сегодня пятница {day:5n}")
# print(f"Сегодня пятница {day:5d}")


# day = 13
# pi_num = 3.14159265
#
# print(f"Сегодня пятница {day:10.2f}")
# print(f"Число pi {pi_num:10.4f}")

name = "Коля"
day = 13

print(f"{name:>10} запустил свой стартап!")
print(f"Сегодня пятница {day:<5}")

star_name = "Солнце"
print(f"{star_name:^10} центр Солнечной системы.")


name = "Коля"
day = 13

print(f"{name:->10} запустил свой стартап!")
print(f"Сегодня пятница {day:-<5}")

star_name = "Солнце"
print(f"{star_name:*^10} центр Солнечной системы.")
